includes/handout/topic-tree.gv
digraph TopicTree {
    compound=true;
    rankdir="LR";

    /* subgraph cluster_proofEngines {
        label = "Proof Engines";
        posEngine -> powEngine;
    } */

    /* subgraph cluster_whitePaper {
        // style=filled;
        // color=lightgrey;
        // node [style=filled];
        label = "White Paper";
        networkTopol -> utSpec;
        tokenomics;
        amarooVision;
        validation -> utSpec;
        dagDetails -> utSpec;
        wpDraft1 -> dagDetails,amarooVision,validation,networkTopol,tokenomics;
    } */

    nosimus [label = "Nos Ultra\nTerminum\nUltimum\nImus, Nunc", ordering=out];

    subgraph cluster_Legend {
        label = "Legend";
        prior [label = "Prior Work", shape=rectangle];
        partOriginal [label = "Original in part", shape=octagon];
        original [label = "Original"];
    }

    consensus [label = "Consensus", ordering=out, shape=octagon];
    pow [label = "Proof of Work (PoW)", shape=rectangle];
    essenceOfPoWDataInclusion [label = "PoW - What does it prove?", shape=rectangle];
    nakamotoConsensus [label = "Nakamoto Consensus", shape=rectangle];
    nakConsensusSafeUnsafe [label = "Extensions\n(safe and unsafe)", shape=octagon];
    PoSConsensusGeneral [label = "Proof of Stake\n(Overview)", shape=rectangle];
    blockDag [label = "Block-DAGs\n(instead of blockchains)", shape=rectangle];
    dosAttacks [label = "DoS Attacks", shape=octagon];
    dataStructsGeneral [label = "Blockchain\nData Structs", shape=rectangle];
    merkleTrees [label = "Merkle Trees", shape=rectangle];
    spvProofs [label = "SPV Proofs", shape=rectangle];
    spvProofsViaSC [label = "SPV Proofs via\nSmart Contracts", shape=rectangle];
    scaling [label = "Scaling", shape=octagon];
    scalingTrilemma [label = "Buterin's Trilemma", shape=rectangle];
    scalingOCSquared [label = "Scaling O(c^2)", shape=rectangle];
    scalingOCCubed [label = "Scaling O(c^3)\nAnd Beyond", shape=octagon];
    scalingON [label = "Scaling O(n)"];
    UT [label = "Ultra Terminum"];
    powReflection [label = "Proof of Reflection"];
    powRefTwoChains [label = "Proof of Reflection\nw/ 2 Chains"];
    //UTCore [label = "Core of Ultra Terminum"];
    powRefSimplex [label = "The Simplex\n(N Chains)"];
    simplexScale [label = "Simplex\nScalability"];
    simplexDappChains [label = "Simplex\nDapp-chains"];
    powRefConfirmationTimes [label = "Simplex\nConfirmation Times"];
    powRefAttacks [label = "Simplex Attacks"];
    simplexPoSVsPurePoS [label = "Simplex + PoS\nvs\nPure PoS"];
    dappChains [label = "Dapp-chains", shape=octagon];
    devPotential [label = "Leveraging\nExisting Projects"];
    devPotentialUniversality [label = "Universality", shape=octagon];
    devPotentialReach [label = "Reach", shape=octagon];
    tiling [label = "Tiling"];
    tilingSec [label = "Security"];

    nosimus -> consensus;
    consensus -> pow;
    pow -> nakamotoConsensus;
    pow -> essenceOfPoWDataInclusion;
    // essenceOfPoWDataInclusion -> nakConsensusSafeUnsafe;
    nakamotoConsensus -> nakConsensusSafeUnsafe;
    consensus -> PoSConsensusGeneral;
    nakamotoConsensus -> blockDag;
    blockDag -> dosAttacks;
    //nakamotoConsensus -> essenceOfPoWDataInclusion;
    nosimus -> dataStructsGeneral -> merkleTrees -> spvProofs -> spvProofsViaSC;
    nosimus -> scaling -> scalingTrilemma;
    scaling -> scalingOCSquared;
    scaling -> dappChains -> scalingOCCubed;
    //scaling -> scalingON;
    nosimus -> UT -> powReflection -> powRefTwoChains;
    powReflection -> powRefSimplex -> simplexScale -> simplexDappChains;
    powRefSimplex -> powRefConfirmationTimes;
    powRefSimplex -> powRefAttacks;
    powRefSimplex -> simplexPoSVsPurePoS;

    dappChains -> devPotential -> devPotentialReach;
    devPotential -> devPotentialUniversality;

    powRefSimplex -> tiling;

    tiling -> scalingON;
    tiling -> tilingSec;
}
